# SQL Project
You were hired by Ironhack to perform an Analytics Consulting Project entitled: competitive landscape.

Your mission is to create and populate an appropriate database with many coding schools that are our competition, as well as design an suitable queries that answer business questions of interest (to be defined by you)

**Suggested Steps in the Project:**


*   Read this notebook and understand each function. Comment the code appropriately

*   Populate the list of schools with a wider variety of schools (how are you going to get the school ID?)

* Take a look at the obtained dataframes. What dimensions do you have? what keys do you have? how could the different dataframes be connected?

* Go back to the drawing board and try to create an entity relationship diagram for tables available

* Once you have the schemas you want, you will need to:
  - create the suitable SQL queries to create the tables and populate them
  - run these queries using the appropriate Python connectors
  
* Bonus: How will this datamodel be updated in the future? Please write auxiliary functions that test the database for data quality issues. For example: how could you make sure you only include the most recent comments when you re-run the script?


# Suggested Deliverables

* 5-6 minute presentation of data model created, decision process and business analysis proposed

* exported .sql file with the final schema

* Supporting python files used to generate all logic

* High level documentation explaining tables designed and focusing on update methods

Crucial hint: check out the following tutorial:
https://www.dataquest.io/blog/sql-insert-tutorial/

In [19]:
# you must populate this dict with the schools required -> try talking to the teaching team about this


schools = {
'ironhack' : 10828,
'app-academy' : 10525,
'springboard' : 11035,
'codingnomads': 10662,
'juno-college-of-technology': 10787,
'wild-code-school': 11169,
'udacity': 11118,
'the-tech-academy': 11091,
'neoland': 10906,
'flatiron-school': 10748,
}

import re
import pandas as pd
from pandas.io.json import json_normalize
import requests



def get_comments_school(school):
    TAG_RE = re.compile(r'<[^>]+>')
    # defines url to make api call to data -> dynamic with school if you want to scrape competition
    url = "https://www.switchup.org/chimera/v1/school-review-list?mainTemplate=school-review-list&path=%2Fbootcamps%2F" + school + "&isDataTarget=false&page=3&perPage=10000&simpleHtml=true&truncationLength=250"
    #makes get request and converts answer to json
    # url defines the page of all the information, request is made, and information is returned to data variable
    data = requests.get(url).json()
    #converts json to dataframe
    reviews =  pd.DataFrame(data['content']['reviews'])
  
    #aux function to apply regex and remove tags
    def remove_tags(x):
        return TAG_RE.sub('',x)
    reviews['review_body'] = reviews['body'].apply(remove_tags)
    reviews['school'] = school
    return reviews

In [20]:
# could you write this as a list comprehension? ;)
comments = []

for school in schools.keys():
    print(school)
    comments.append(get_comments_school(school))

comments = pd.concat(comments)
comments.drop(columns=['anonymous','hostProgramName', 'isAlumni', 'body', 'user', 'comments'], inplace=True)
comments[['overallScore','overall','curriculum','jobSupport']] = comments[['overallScore','overall','curriculum','jobSupport']].astype(float)

ironhack
app-academy
springboard
codingnomads
juno-college-of-technology
wild-code-school
udacity
the-tech-academy
neoland
flatiron-school

In [21]:
comments

,id,name,graduatingYear,jobTitle,tagline,createdAt,queryDate,program,overallScore,overall,curriculum,jobSupport,review_body,school
0,272383,Anonymous,2020.0,Student,Check out the statistics before applying,1/18/2021,2021-01-18,UX/UI Design Bootcamp,2.3,2.0,3.0,2.0,I attended the full time UX/UI Design bootcamp...,ironhack
1,272083,Anonymous,2020.0,Head of Sales / Fullstack developer,Valuable investment !,1/9/2021,2021-01-09,Web Development Part-Time,5.0,5.0,5.0,5.0,Learning to code from very limited understandi...,ironhack
2,271958,Cinthya Langue Blois,2020.0,Power BI Junior Consultant,The Best Experience in My Life,1/5/2021,2021-01-05,None,5.0,5.0,5.0,5.0,I did the 9-week Data Analytics Bootcamp and i...,ironhack
3,271792,Alicia Hernandez Lopez,2020.0,,Highly recommendable!,12/28/2020,2020-12-28,,5.0,5.0,5.0,5.0,With no previous IT education I entered the We...,ironhack
4,271459,Andrea,2020.0,UX/UI Design,100% Reccomend,12/16/2020,2020-12-16,UX/UI Design Part-Time,4.7,5.0,4.0,5.0,The community is amazing like no other school....,ironhack
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
243,233319,Roberto,2015.0,None,"Solid institution, solid program.",2/23/2016,2016-02-23,None,5.0,5.0,NaN,NaN,"For me, choosing a program to get into web dev...",flatiron-school
244,232907,Anonymous,2015.0,None,The Job Report Reflects the Flatiron of 2014 n...,10/1/2015,2015-10-01,None,4.0,4.0,NaN,NaN,The education is likely better than ever. The ...,flatiron-school
245,231804,Ian Miller,2014.0,None,Flatiron School has been one of the best inves...,9/20/2014,2014-09-20,None,5.0,5.0,5.0,5.0,Hello! I am a graduate and I am also currently...,flatiron-school
246,231803,Anonymous,2014.0,None,I could probably write a dissertation on how m...,9/20/2014,2014-09-20,None,5.0,5.0,5.0,5.0,I could probably write a dissertation on how m...,flatiron-school
247,231661,Samuel Owens,NaN,None,,6/15/2014,2014-06-15,None,5.0,5.0,NaN,NaN,A wonderful experience. They teach how to code...,flatiron-school

In [22]:
from pandas.io.json import json_normalize

def get_school_info(school, school_id):
    url = 'https://www.switchup.org/chimera/v1/bootcamp-data?mainTemplate=bootcamp-data%2Fdescription&path=%2Fbootcamps%2F'+ str(school) + '&isDataTarget=false&bootcampId='+ str(school_id) + '&logoTag=logo&truncationLength=250&readMoreOmission=...&readMoreText=Read%20More&readLessText=Read%20Less'

    data = requests.get(url).json()

    data.keys()

    courses = data['content']['courses']
    courses_df = pd.DataFrame(courses, columns= ['courses'])

    locations = data['content']['locations']
    locations_df = json_normalize(locations)

    badges_df = pd.DataFrame(data['content']['meritBadges'])
    
    website = data['content']['webaddr']
    description = data['content']['description']
    logoUrl = data['content']['logoUrl']
    school_df = pd.DataFrame([website,description,logoUrl]).T
    school_df.columns =  ['website','description','LogoUrl']

    locations_df['school'] = school
    courses_df['school'] = school
    badges_df['school'] = school
    school_df['school'] = school
    

    locations_df['school_id'] = school_id
    courses_df['school_id'] = school_id
    badges_df['school_id'] = school_id
    school_df['school_id'] = school_id

    return locations_df, courses_df, badges_df, school_df

locations_list = []
courses_list = []
badges_list = []
schools_list = []

for school, id in schools.items():
    print(school)
    a,b,c,d = get_school_info(school,id)
    
    locations_list.append(a)
    courses_list.append(b)
    badges_list.append(c)
    schools_list.append(d)

ironhack

<ipython-input-22-7111c633f1e2>:14: FutureWarning: pandas.io.json.json_normalize is deprecated, use pandas.json_normalize instead
  locations_df = json_normalize(locations)

app-academy
springboard
codingnomads
juno-college-of-technology
wild-code-school
udacity
the-tech-academy
neoland
flatiron-school

In [23]:
locations_list

[      id               description  country.id   country.name country.abbrev  \
 0  15901           Berlin, Germany        57.0        Germany             DE
 1  16022       Mexico City, Mexico        29.0         Mexico             MX
 2  16086    Amsterdam, Netherlands        59.0    Netherlands             NL
 3  16088         Sao Paulo, Brazil        42.0         Brazil             BR
 4  16109             Paris, France        38.0         France             FR
 5  16375  Miami, FL, United States         1.0  United States             US
 6  16376             Madrid, Spain        12.0          Spain             ES
 7  16377          Barcelona, Spain        12.0          Spain             ES
 8  16709          Lisbon, Portugal        28.0       Portugal             PT
 9  17233                    Online         NaN            NaN            NaN

    city.id    city.name city.keyword  state.id state.name state.abbrev  \
 0  31156.0       Berlin       berlin       NaN        NaN          NaN
 1  31175.0  Mexico City  mexico-city       NaN        NaN          NaN
 2  31168.0    Amsterdam    amsterdam       NaN        NaN          NaN
 3  31121.0    Sao Paulo    sao-paulo       NaN        NaN          NaN
 4  31136.0        Paris        paris       NaN        NaN          NaN
 5     31.0        Miami        miami      11.0    Florida           FL
 6  31052.0       Madrid       madrid       NaN        NaN          NaN
 7  31170.0    Barcelona    barcelona       NaN        NaN          NaN
 8  31075.0       Lisbon       lisbon       NaN        NaN          NaN
 9      NaN          NaN          NaN       1.0     Online       Online

   state.keyword    school  school_id
 0           NaN  ironhack      10828
 1           NaN  ironhack      10828
 2           NaN  ironhack      10828
 3           NaN  ironhack      10828
 4           NaN  ironhack      10828
 5       florida  ironhack      10828
 6           NaN  ironhack      10828
 7           NaN  ironhack      10828
 8           NaN  ironhack      10828
 9        online  ironhack      10828  ,
       id                       description  country.id   country.name  \
 0  15704  San Francisco, CA, United States         1.0  United States
 1  15705  New York City, NY, United States         1.0  United States
 2  15862                            Online         NaN            NaN

   country.abbrev  state.id  state.name state.abbrev state.keyword  city.id  \
 0             US         6  California           CA    california     13.0
 1             US        34    New York           NY      new-york   1507.0
 2            NaN         1      Online       Online        online      NaN

        city.name   city.keyword       school  school_id
 0  San Francisco  san-francisco  app-academy      10525
 1            NYC  new-york-city  app-academy      10525
 2            NaN            NaN  app-academy      10525  ,
       id description  state.id state.name state.abbrev state.keyword  \
 0  16013      Online         1     Online       Online        online

         school  school_id
 0  springboard      11035  ,
       id      description  country.id country.name country.abbrev  city.id  \
 0  16347  Bali, Indonesia        35.0    Indonesia             ID  31169.0
 1  16472           Online         NaN          NaN            NaN      NaN

   city.name city.keyword  state.id state.name state.abbrev state.keyword  \
 0      Bali         bali       NaN        NaN          NaN           NaN
 1       NaN          NaN       1.0     Online       Online        online

          school  school_id
 0  codingnomads      10662
 1  codingnomads      10662  ,
       id      description  country.id country.name country.abbrev  city.id  \
 0  15717  Toronto, Canada         2.0       Canada             CA  31152.0
 1  17414           Online         NaN          NaN            NaN      NaN

   city.name city.keyword  state.id state.name state.abbrev state.keyword  \
 0   Toronto      toronto       NaN        NaN          NaN           NaN
 1       NaN          NaN       1.0     Online       Online        online

                        school  school_id
 0  juno-college-of-technology      10787
 1  juno-college-of-technology      10787  ,
        id             description  country.id country.name country.abbrev  \
 0   16809           Paris, France        38.0       France             FR
 1   16811       Brussels, Belgium        46.0      Belgium             BE
 2   16813         Berlin, Germany        57.0      Germany             DE
 3   16814        La Loupe, France        38.0       France             FR
 4   16815      Bucharest, Romania         4.0      Romania             RO
 5   16816           Lille, France        38.0       France             FR
 6   16817            Lyon, France        38.0       France             FR
 7   16819       Marseille, France        38.0       France             FR
 8   17132        Biarritz, France        38.0       France             FR
 9   17133        Bordeaux, France        38.0       France             FR
 10  17134          Nantes, France        38.0       France             FR
 11  17135         Orléans, France        38.0       France             FR
 12  17136           Reims, France        38.0       France             FR
 13  17137      Strasbourg, France        38.0       France             FR
 14  17138        Toulouse, France        38.0       France             FR
 15  17139           Tours, France        38.0       France             FR
 16  17140       Budapest, Hungary        21.0      Hungary             HU
 17  17141         Dublin, Ireland        25.0      Ireland             IE
 18  17142        Lisbon, Portugal        28.0     Portugal             PT
 19  17143         London, England        61.0      England             GB
 20  17144           Madrid, Spain        12.0        Spain             ES
 21  17145            Milan, Italy        39.0        Italy             IT
 22  17146  Amsterdam, Netherlands        59.0  Netherlands             NL
 23  17147        Barcelona, Spain        12.0        Spain             ES
 24  17472                  Online         NaN          NaN            NaN
 25  17473      Bruxelles, Belgium        46.0      Belgium             BE

     city.id   city.name city.keyword  state.id state.name state.abbrev  \
 0   31136.0       Paris        paris       NaN        NaN          NaN
 1   31125.0    Brussels     brussels       NaN        NaN          NaN
 2   31156.0      Berlin       berlin       NaN        NaN          NaN
 3   31187.0    La Loupe     la-loupe       NaN        NaN          NaN
 4   31040.0   Bucharest    bucharest       NaN        NaN          NaN
 5   31128.0       Lille        lille       NaN        NaN          NaN
 6   31106.0        Lyon         lyon       NaN        NaN          NaN
 7   31129.0   Marseille    marseille       NaN        NaN          NaN
 8   31186.0    Biarritz     biarritz       NaN        NaN          NaN
 9   31124.0    Bordeaux     bordeaux       NaN        NaN          NaN
 10  31130.0      Nantes       nantes       NaN        NaN          NaN
 11  31188.0     Orléans      orleans       NaN        NaN          NaN
 12  31189.0       Reims        reims       NaN        NaN          NaN
 13  31190.0  Strasbourg   strasbourg       NaN        NaN          NaN
 14  31191.0    Toulouse     toulouse       NaN        NaN          NaN
 15  31192.0       Tours        tours       NaN        NaN          NaN
 16  31066.0    Budapest     budapest       NaN        NaN          NaN
 17  31099.0      Dublin       dublin       NaN        NaN          NaN
 18  31075.0      Lisbon       lisbon       NaN        NaN          NaN
 19  31176.0      London       london       NaN        NaN          NaN
 20  31052.0      Madrid       madrid       NaN        NaN          NaN
 21  31107.0       Milan        milan       NaN        NaN          NaN
 22  31168.0   Amsterdam    amsterdam       NaN        NaN          NaN
 23  31170.0   Barcelona    barcelona       NaN        NaN          NaN
 24      NaN         NaN          NaN       1.0     Online       Online
 25  31241.0   Bruxelles    bruxelles       NaN        NaN          NaN

    state.keyword            school  school_id
 0            NaN  wild-code-school      11169
 1            NaN  wild-code-school      11169
 2            NaN  wild-code-school      11169
 3            NaN  wild-code-school      11169
 4            NaN  wild-code-school      11169
 5            NaN  wild-code-school      11169
 6            NaN  wild-code-school      11169
 7            NaN  wild-code-school      11169
 8            NaN  wild-code-school      11169
 9            NaN  wild-code-school      11169
 10           NaN  wild-code-school      11169
 11           NaN  wild-code-school      11169
 12           NaN  wild-code-school      11169
 13           NaN  wild-code-school      11169
 14           NaN  wild-code-school      11169
 15           NaN  wild-code-school      11169
 16           NaN  wild-code-school      11169
 17           NaN  wild-code-school      11169
 18           NaN  wild-code-school      11169
 19           NaN  wild-code-school      11169
 20           NaN  wild-code-school      11169
 21           NaN  wild-code-school      11169
 22           NaN  wild-code-school      11169
 23           NaN  wild-code-school      11169
 24        online  wild-code-school      11169
 25           NaN  wild-code-school      11169  ,
       id description  state.id state.name state.abbrev state.keyword   school  \
 0  15807      Online         1     Online       Online        online  udacity

    school_id
 0      11118  ,
       id                        description  country.id   country.name  \
 0  15729        Portland, OR, United States         1.0  United States
 1  15976                         Denver, CO         1.0  United States
 2  16008         Seattle, WA, United States         1.0  United States
 3  16404                             Online         NaN            NaN
 4  17041  Salt Lake City, UT, United States         1.0  United States

   country.abbrev  state.id  state.name state.abbrev state.keyword  city.id  \
 0             US        39      Oregon           OR        oregon     76.0
 1             US         7    Colorado           CO      colorado  27420.0
 2             US        49  Washington           WA    washington   1223.0
 3            NaN         1      Online       Online        online      NaN
 4             US        46        Utah           UT          utah   1168.0

         city.name    city.keyword            school  school_id
 0        Portland        portland  the-tech-academy      11091
 1     Wheat Ridge     wheat-ridge  the-tech-academy      11091
 2          Renton          renton  the-tech-academy      11091
 3             NaN             NaN  the-tech-academy      11091
 4  Salt Lake City  salt-lake-city  the-tech-academy      11091  ,
       id       description  country.id country.name country.abbrev  city.id  \
 0  15843     Madrid, Spain        12.0        Spain             ES  31052.0
 1  15911  Barcelona, Spain        12.0        Spain             ES  31170.0
 2  17012            Online         NaN          NaN            NaN      NaN

    city.name city.keyword  state.id state.name state.abbrev state.keyword  \
 0     Madrid       madrid       NaN        NaN          NaN           NaN
 1  Barcelona    barcelona       NaN        NaN          NaN           NaN
 2        NaN          NaN       1.0     Online       Online        online

     school  school_id
 0  neoland      10906
 1  neoland      10906
 2  neoland      10906  ,
        id        description  country.id    country.name country.abbrev  \
 0   15743  New York City, NY         1.0   United States             US
 1   15872        Houston, TX         1.0   United States             US
 2   16257             Online         NaN             NaN            NaN
 3   16473     Washington, DC         1.0   United States             US
 4   16680        Seattle, WA         1.0   United States             US
 5   16681        Atlanta, GA         1.0   United States             US
 6   16761         Denver, CO         1.0   United States             US
 7   16762        Chicago, IL         1.0   United States             US
 8   16943         Austin, TX         1.0   United States             US
 9   16958    London, England        11.0  United Kingdom             GB
 10  17109       Brooklyn, NY         1.0   United States             US
 11  17110  San Francisco, CA         1.0   United States             US

     state.id            state.name state.abbrev         state.keyword  \
 0       34.0              New York           NY              new-york
 1       45.0                 Texas           TX                 texas
 2        1.0                Online       Online                online
 3       10.0  District of Columbia           DC  district-of-columbia
 4       49.0            Washington           WA            washington
 5       12.0               Georgia           GA               georgia
 6        7.0              Colorado           CO              colorado
 7       15.0              Illinois           IL              illinois
 8       45.0                 Texas           TX                 texas
 9        NaN                   NaN          NaN                   NaN
 10      34.0              New York           NY              new-york
 11       6.0            California           CA            california

     city.id        city.name   city.keyword           school  school_id
 0    1507.0              NYC  new-york-city  flatiron-school      10748
 1      81.0          Houston        houston  flatiron-school      10748
 2       NaN              NaN            NaN  flatiron-school      10748
 3     775.0  Washington D.C.  washington-dc  flatiron-school      10748
 4      97.0          Seattle        seattle  flatiron-school      10748
 5      36.0          Atlanta        atlanta  flatiron-school      10748
 6      27.0           Denver         denver  flatiron-school      10748
 7      39.0          Chicago        chicago  flatiron-school      10748
 8      84.0           Austin         austin  flatiron-school      10748
 9   31176.0           London         london  flatiron-school      10748
 10   1286.0         Brooklyn       brooklyn  flatiron-school      10748
 11     13.0    San Francisco  san-francisco  flatiron-school      10748  ]

In [24]:
locations = pd.concat(locations_list)
locations

locations.drop(columns= ['country.abbrev','city.keyword','state.id','state.name','state.abbrev','state.keyword','school'], inplace=True)

locations

,id,description,country.id,country.name,city.id,city.name,school_id
0,15901,"Berlin, Germany",57.0,Germany,31156.0,Berlin,10828
1,16022,"Mexico City, Mexico",29.0,Mexico,31175.0,Mexico City,10828
2,16086,"Amsterdam, Netherlands",59.0,Netherlands,31168.0,Amsterdam,10828
3,16088,"Sao Paulo, Brazil",42.0,Brazil,31121.0,Sao Paulo,10828
4,16109,"Paris, France",38.0,France,31136.0,Paris,10828
...,...,...,...,...,...,...,...
7,16762,"Chicago, IL",1.0,United States,39.0,Chicago,10748
8,16943,"Austin, TX",1.0,United States,84.0,Austin,10748
9,16958,"London, England",11.0,United Kingdom,31176.0,London,10748
10,17109,"Brooklyn, NY",1.0,United States,1286.0,Brooklyn,10748
11,17110,"San Francisco, CA",1.0,United States,13.0,San Francisco,10748

In [25]:
courses = pd.concat(courses_list)
courses.head(10)
courses.drop(columns=['school'], inplace=True)
courses.reset_index(inplace=True)
courses.reset_index(inplace=True)
courses.drop(columns=['index'], inplace=True)
courses1 = courses.rename(columns = {'level_0':'courses_id'})
courses1

     courses_id                              courses  school_id
0             0              Data Analytics Bootcamp      10828
1             1             Data Analytics Part-Time      10828
2             2                UX/UI Design Bootcamp      10828
3             3               UX/UI Design Part-Time      10828
4             4             Web Development Bootcamp      10828
..          ...                                  ...        ...
98           98                    Data Science Prep      10748
99           99  Hacking 101: Intro to Cybersecurity      10748
100         100       Online Cybersecurity Analytics      10748
101         101                  Online Data Science      10748
102         102          Online Software Engineering      10748

[103 rows x 3 columns]

In [26]:
import numpy as np
import random
badges = pd.concat(badges_list)
badges.drop(columns = ['keyword','description','school'],inplace = True)
badges['badge_id'] = range(1000,len(badges)+1000)
cols = list(badges.columns)
cols.remove('badge_id')
badges = badges[['badge_id']+cols]
badges

   badge_id               name  school_id
0      1000   Available Online      10828
1      1001  Verified Outcomes      10828
2      1002   Flexible Classes      10828
0      1003   Available Online      10525
1      1004   Flexible Classes      10525
2      1005      Job Guarantee      10525
0      1006   Available Online      11035
1      1007   Flexible Classes      11035
2      1008      Job Guarantee      11035
0      1009   Available Online      10662
1      1010   Flexible Classes      10662
0      1011   Available Online      10787
1      1012  Verified Outcomes      10787
2      1013   Flexible Classes      10787
0      1014   Available Online      11169
1      1015   Flexible Classes      11169
0      1016   Available Online      11118
1      1017   Flexible Classes      11118
0      1018   Available Online      11091
1      1019  Verified Outcomes      11091
2      1020   Flexible Classes      11091
0      1021   Available Online      10906
1      1022   Flexible Classes      10906
0      1023   Available Online      10748
1      1024  Verified Outcomes      10748
2      1025   Flexible Classes      10748

In [27]:
# any data cleaning still missing here? take a look at the description
schools = pd.concat(schools_list)
schools.head()
schools.drop(columns=['description','LogoUrl'], inplace=True)
cols = list(schools.columns)
cols.remove('school_id')
schools = schools[['school_id']+cols]
comments = comments.merge(schools, left_on='school', right_on='school')
comments.drop(columns=['website','school'], inplace=True)

In [28]:
comments

,id,name,graduatingYear,jobTitle,tagline,createdAt,queryDate,program,overallScore,overall,curriculum,jobSupport,review_body,school_id
0,272383,Anonymous,2020.0,Student,Check out the statistics before applying,1/18/2021,2021-01-18,UX/UI Design Bootcamp,2.3,2.0,3.0,2.0,I attended the full time UX/UI Design bootcamp...,10828
1,272083,Anonymous,2020.0,Head of Sales / Fullstack developer,Valuable investment !,1/9/2021,2021-01-09,Web Development Part-Time,5.0,5.0,5.0,5.0,Learning to code from very limited understandi...,10828
2,271958,Cinthya Langue Blois,2020.0,Power BI Junior Consultant,The Best Experience in My Life,1/5/2021,2021-01-05,None,5.0,5.0,5.0,5.0,I did the 9-week Data Analytics Bootcamp and i...,10828
3,271792,Alicia Hernandez Lopez,2020.0,,Highly recommendable!,12/28/2020,2020-12-28,,5.0,5.0,5.0,5.0,With no previous IT education I entered the We...,10828
4,271459,Andrea,2020.0,UX/UI Design,100% Reccomend,12/16/2020,2020-12-16,UX/UI Design Part-Time,4.7,5.0,4.0,5.0,The community is amazing like no other school....,10828
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
5015,233319,Roberto,2015.0,None,"Solid institution, solid program.",2/23/2016,2016-02-23,None,5.0,5.0,NaN,NaN,"For me, choosing a program to get into web dev...",10748
5016,232907,Anonymous,2015.0,None,The Job Report Reflects the Flatiron of 2014 n...,10/1/2015,2015-10-01,None,4.0,4.0,NaN,NaN,The education is likely better than ever. The ...,10748
5017,231804,Ian Miller,2014.0,None,Flatiron School has been one of the best inves...,9/20/2014,2014-09-20,None,5.0,5.0,5.0,5.0,Hello! I am a graduate and I am also currently...,10748
5018,231803,Anonymous,2014.0,None,I could probably write a dissertation on how m...,9/20/2014,2014-09-20,None,5.0,5.0,5.0,5.0,I could probably write a dissertation on how m...,10748
5019,231661,Samuel Owens,NaN,None,,6/15/2014,2014-06-15,None,5.0,5.0,NaN,NaN,A wonderful experience. They teach how to code...,10748

In [41]:
import pymysql
from sqlalchemy import create_engine

engine = create_engine("mysql+pymysql://{user}:{pw}@database-1.cjqwcjdugoty.us-east-2.rds.amazonaws.com/{db}".format(user='admin',
                                                                                    pw='Ironhack1',
                                                                                    db='ironhack'))
badges.to_sql('badges',con=engine,if_exists='replace',index = False,chunksize=1000)
schools.to_sql('schools',con=engine,if_exists='replace',index = False,chunksize=1000)
locations.to_sql('locations',con=engine,if_exists='replace',index = False,chunksize=1000)
comments.to_sql('comments',con=engine,if_exists='replace',index = False,chunksize=1000)
courses1.to_sql('courses1',con=engine,if_exists='replace',index = False,chunksize=1000)

In [40]:
len(comments)

5020